## Анализ набора данных с использованием `pandas` (2)

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv('Employee.csv')

In [2]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [2]:
df.columns

Index(['Education', 'JoiningYear', 'City', 'PaymentTier', 'Age', 'Gender',
       'EverBenched', 'ExperienceInCurrentDomain', 'LeaveOrNot'],
      dtype='object')

In [3]:
df.groupby('EverBenched')['LeaveOrNot'].mean()*100

EverBenched
No     33.125749
Yes    45.397490
Name: LeaveOrNot, dtype: float64

Постройте сводную таблицу, показывающую средний возраст сотрудников в каждом городе.

In [8]:
pd.pivot_table(df, values='Age', index='City', aggfunc='mean')

                 Age
City
Bangalore  29.594255
New Delhi  29.121003
Pune       29.288644

In [9]:
df.pivot_table( values='Age', index='City', aggfunc='mean').round(2)

             Age
City
Bangalore  29.59
New Delhi  29.12
Pune       29.29

In [10]:
df.groupby('City')['Age'].mean()

City
Bangalore    29.594255
New Delhi    29.121003
Pune         29.288644
Name: Age, dtype: float64

Рассчитайте количество сотрудников по каждому уровню образования и их средний возраст.

In [11]:
df.pivot_table(values='Age', index='Education', aggfunc=['count','mean'])

          count       mean
            Age        Age
Education
Bachelors  3601  29.422938
Masters     873  29.290951
PHD         179  29.296089

In [13]:
df.groupby('Education').agg( Employees=('Education', 'count'), Age=('Age', 'mean'))

           Employees        Age
Education
Bachelors       3601  29.422938
Masters          873  29.290951
PHD              179  29.296089

In [14]:
df.groupby('Education')['Age'].agg([('Количество', 'count'), ('Средний возраст', 'mean')]).round(2)

           Количество  Средний возраст
Education
Bachelors        3601            29.42
Masters           873            29.29
PHD               179            29.30

Создайте сводную таблицу, показывающую количество мужчин и женщин в каждом уровне оплаты (Payment Tier).

In [15]:
df.pivot_table(values='Age', index=['PaymentTier','Gender'], aggfunc=['count'])

                   count
                     Age
PaymentTier Gender
1           Female   131
            Male     112
2           Female   605
            Male     313
3           Female  1139
            Male    2353

In [16]:
df.pivot_table(index='PaymentTier', columns='Gender', values='Age', aggfunc='count')

Gender       Female  Male
PaymentTier
1               131   112
2               605   313
3              1139  2353

Составьте сводную таблицу, отражающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от того, были ли они когда-либо исключены из проектов на месяц или более.

In [17]:
stats = df.groupby('EverBenched')['LeaveOrNot'].agg([ ('Всего', 'count'), ('Уволились', 'sum')])
stats['Остались'] = stats['Всего'] - stats['Уволились']

stats['Процент уволившихся'] = (stats['Уволились'] / stats['Всего'] * 100).round(1)
stats['Процент оставшихся'] = (stats['Остались'] / stats['Всего'] * 100).round(1)
stats.drop(columns=['Всего', 'Уволились', 'Остались'], inplace=True)
stats

             Процент уволившихся  Процент оставшихся
EverBenched
No                          33.1                66.9
Yes                         45.4                54.6

In [18]:
piv_table = df.pivot_table(index='EverBenched', values='LeaveOrNot', aggfunc='mean')


piv_table['Percent_Left'] = piv_table['LeaveOrNot'] * 100
piv_table = piv_table.drop(columns='LeaveOrNot')
piv_table

             Percent_Left
EverBenched
No              33.125749
Yes             45.397490

Постройте сводную таблицу, отображающую медианный опыт работы в текущей области в зависимости от уровня образования и пола сотрудников.

In [19]:
df.groupby([ 'Gender','Education']).agg(Experience=('ExperienceInCurrentDomain', 'median'))

                  Experience
Gender Education
Female Bachelors         3.0
       Masters           2.0
       PHD               3.0
Male   Bachelors         3.0
       Masters           3.0
       PHD               3.0

In [20]:
df.pivot_table(index='Gender', columns='Education', values='ExperienceInCurrentDomain', aggfunc='mean')

Education  Bachelors   Masters       PHD
Gender
Female      2.904530  2.846361  2.797101
Male        2.914589  2.912351  2.981818

In [21]:
df.pivot_table(index='Education', columns='Gender', values='ExperienceInCurrentDomain', aggfunc='median')

Gender     Female  Male
Education
Bachelors     3.0   3.0
Masters       2.0   3.0
PHD           3.0   3.0

Рассчитайте количество сотрудников по каждому году присоединения к компании и их средний возраст.

Создайте сводную таблицу, показывающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня образования и города, в котором они работают.

Составьте сводную таблицу, отображающую средний возраст сотрудников, которые были когда-либо исключены из проектов, и тех, кто не был, в зависимости от уровня оплаты.

Постройте сводную таблицу, показывающую средний возраст сотрудников, которые покинули компанию в следующие два года, в зависимости от города и опыта работы в текущей области.

Создайте сводную таблицу, отображающую процент сотрудников, покинувших компанию в следующие два года, в зависимости от уровня оплаты и того, были ли они когда-либо исключены из проектов на месяц или более.